velioo_webserver/tests/httperf_test_application11.txt
httperf --client=0/1 --server=localhost --port=8888 --uri=/application --rate=120 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 2

Total: connections 10000 requests 10000 replies 10000 test-duration 83.331 s

Connection rate: 120.0 conn/s (8.3 ms/conn, <=13 concurrent connections)
Connection time [ms]: min 4.4 avg 12.8 max 173.7 median 4.5 stddev 19.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 120.0 req/s (8.3 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 118.4 avg 120.0 max 121.6 stddev 0.8 (16 samples)
Reply time [ms]: response 11.6 transfer 1.2
Reply size [B]: header 109.0 content 136.0 footer 0.0 (total 245.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 10.14 system 68.27 (user 12.2% system 81.9% total 94.1%)
Net I/O: 37.3 KB/s (0.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0