velioo_webserver/tests/httperf_test_application12.txt
httperf --client=0/1 --server=localhost --port=8888 --uri=/application --rate=130 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 3

Total: connections 10000 requests 10000 replies 10000 test-duration 76.921 s

Connection rate: 130.0 conn/s (7.7 ms/conn, <=16 concurrent connections)
Connection time [ms]: min 4.4 avg 17.6 max 168.6 median 4.5 stddev 25.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 130.0 req/s (7.7 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 128.0 avg 130.0 max 132.0 stddev 0.9 (15 samples)
Reply time [ms]: response 16.1 transfer 1.5
Reply size [B]: header 109.0 content 136.0 footer 0.0 (total 245.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 8.63 system 62.54 (user 11.2% system 81.3% total 92.5%)
Net I/O: 40.4 KB/s (0.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0