velioo_webserver/tests/httperf_test_application14.txt
httperf --client=0/1 --server=localhost --port=8888 --uri=/application --rate=160 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 3

Total: connections 10000 requests 10000 replies 10000 test-duration 62.498 s

Connection rate: 160.0 conn/s (6.2 ms/conn, <=25 concurrent connections)
Connection time [ms]: min 4.4 avg 49.3 max 179.8 median 45.5 stddev 39.7
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 160.0 req/s (6.2 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 157.2 avg 160.0 max 162.0 stddev 1.5 (12 samples)
Reply time [ms]: response 46.8 transfer 2.5
Reply size [B]: header 109.0 content 136.0 footer 0.0 (total 245.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.36 system 50.91 (user 8.6% system 81.5% total 90.0%)
Net I/O: 49.7 KB/s (0.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0