velioo_webserver/tests/httperf_test_application17.txt
httperf --timeout=5 --client=0/1 --server=localhost --port=8888 --uri=/application --rate=200 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 4

Total: connections 10000 requests 7093 replies 6132 test-duration 54.221 s

Connection rate: 184.4 conn/s (5.4 ms/conn, <=794 concurrent connections)
Connection time [ms]: min 7.1 avg 1704.7 max 8007.4 median 1200.5 stddev 1354.5
Connection time [ms]: connect 644.7
Connection length [replies/conn]: 1.000

Request rate: 130.8 req/s (7.6 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 94.8 avg 114.4 max 133.8 stddev 13.4 (10 samples)
Reply time [ms]: response 1272.0 transfer 1.6
Reply size [B]: header 130.0 content 136.0 footer 0.0 (total 266.0)
Reply status: 1xx=0 2xx=6132 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.71 system 39.71 (user 1.3% system 73.2% total 74.5%)
Net I/O: 38.7 KB/s (0.3*10^6 bps)

Errors: total 3868 client-timo 3868 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0