velioo_webserver/tests/httperf_test_application_async11.txt
httperf --timeout=5 --client=0/1 --server=localhost --port=8887 --uri=/application --rate=340 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 9

Total: connections 10000 requests 10000 replies 10000 test-duration 29.650 s

Connection rate: 337.3 conn/s (3.0 ms/conn, <=70 concurrent connections)
Connection time [ms]: min 0.1 avg 18.9 max 242.3 median 2.5 stddev 36.9
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 337.3 req/s (3.0 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 338.2 avg 340.0 max 341.6 stddev 1.4 (5 samples)
Reply time [ms]: response 18.7 transfer 0.2
Reply size [B]: header 130.0 content 136.0 footer 0.0 (total 266.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.34 system 23.90 (user 14.6% system 80.6% total 95.2%)
Net I/O: 111.7 KB/s (0.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0