velioo_webserver/tests/httperf_test_application_async6.txt
httperf --timeout=5 --client=0/1 --server=localhost --port=8887 --uri=/application --rate=200 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
Maximum connect burst length: 5

Total: connections 10000 requests 10000 replies 10000 test-duration 49.999 s

Connection rate: 200.0 conn/s (5.0 ms/conn, <=50 concurrent connections)
Connection time [ms]: min 0.1 avg 15.4 max 246.3 median 4.5 stddev 30.9
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 200.0 req/s (5.0 ms/req)
Request size [B]: 73.0

Reply rate [replies/s]: min 192.0 avg 200.0 max 208.6 stddev 3.9 (10 samples)
Reply time [ms]: response 15.1 transfer 0.2
Reply size [B]: header 130.0 content 136.0 footer 0.0 (total 266.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.16 system 39.42 (user 10.3% system 78.8% total 89.2%)
Net I/O: 66.2 KB/s (0.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0