velioo_webserver/tests/httperf_test_cgi7.txt
httperf --client=0/1 --server=localhost --port=8888 --uri=/cgi-bin/app/test.py --rate=10 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 116.541 s

Connection rate: 8.6 conn/s (116.5 ms/conn, <=187 concurrent connections)
Connection time [ms]: min 123.8 avg 12859.7 max 20786.6 median 13696.5 stddev 5479.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 8.6 req/s (116.5 ms/req)
Request size [B]: 81.0

Reply rate [replies/s]: min 5.8 avg 8.3 max 10.6 stddev 1.1 (23 samples)
Reply time [ms]: response 11930.9 transfer 928.8
Reply size [B]: header 42.0 content 92.0 footer 0.0 (total 134.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.61 system 103.10 (user 4.8% system 88.5% total 93.3%)
Net I/O: 1.8 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0