velioo_webserver/tests/httperf_test_cgi8.txt
httperf --client=0/1 --server=localhost --port=8888 --uri=/cgi-bin/app/test.py --rate=5 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 199.901 s

Connection rate: 5.0 conn/s (199.9 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 99.6 avg 111.9 max 365.8 median 103.5 stddev 27.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 5.0 req/s (199.9 ms/req)
Request size [B]: 81.0

Reply rate [replies/s]: min 5.0 avg 5.0 max 5.0 stddev 0.0 (39 samples)
Reply time [ms]: response 100.7 transfer 11.2
Reply size [B]: header 42.0 content 92.0 footer 0.0 (total 134.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 28.83 system 167.21 (user 14.4% system 83.6% total 98.1%)
Net I/O: 1.1 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0