velioo_webserver/tests/httperf_test_cgi_async2.txt
httperf --timeout=30 --client=0/1 --server=localhost --port=8887 --uri=/cgi-bin/app/test.py --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 124.975 s

Connection rate: 8.0 conn/s (125.0 ms/conn, <=10 concurrent connections)
Connection time [ms]: min 99.1 avg 152.9 max 1345.8 median 100.5 stddev 183.1
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.0 ms/req)
Request size [B]: 81.0

Reply rate [replies/s]: min 6.6 avg 8.0 max 9.6 stddev 0.4 (24 samples)
Reply time [ms]: response 137.1 transfer 15.8
Reply size [B]: header 42.0 content 114.0 footer 0.0 (total 156.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 21.52 system 100.98 (user 17.2% system 80.8% total 98.0%)
Net I/O: 1.9 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0