velioo_webserver/tests/httperf_test_cgi_async3.txt
httperf --timeout=30 --client=0/1 --server=localhost --port=8887 --uri=/cgi-bin/app/test.py --rate=9 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 113.852 s

Connection rate: 8.8 conn/s (113.9 ms/conn, <=54 concurrent connections)
Connection time [ms]: min 99.5 avg 3181.7 max 6061.2 median 2898.5 stddev 1505.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 8.8 req/s (113.9 ms/req)
Request size [B]: 81.0

Reply rate [replies/s]: min 5.8 avg 8.6 max 9.8 stddev 0.9 (22 samples)
Reply time [ms]: response 2811.0 transfer 370.7
Reply size [B]: header 42.0 content 114.0 footer 0.0 (total 156.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 9.67 system 96.30 (user 8.5% system 84.6% total 93.1%)
Net I/O: 2.0 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0